tests/performance/artillery-config.yml
# Artillery Configuration for RAG Chatbot Load Testing
# Run with: artillery run artillery-config.yml

config:
  target: "http://localhost:3000"
  phases:
    # Smoke test - verify basic functionality
    - name: "Smoke Test"
      duration: 60
      arrivalRate: 1
      
    # Normal load
    - name: "Normal Load"
      duration: 300
      arrivalRate: 5
      rampTo: 10
      
    # Peak load
    - name: "Peak Load"
      duration: 300
      arrivalRate: 10
      rampTo: 50
      
    # Stress test
    - name: "Stress Test"
      duration: 300
      arrivalRate: 50
      rampTo: 100
      
  defaults:
    headers:
      Content-Type: "application/json"
      
  plugins:
    expect:
      expectDefault: true
      
  environments:
    development:
      target: "http://localhost:3000"
    staging:
      target: "https://staging.rag-chatbot.com"
    production:
      target: "https://rag-chatbot.com"

scenarios:
  # Health check scenario
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: "status"

  # Chat API scenario
  - name: "Chat Request"
    weight: 60
    flow:
      - post:
          url: "/api/chat"
          json:
            message: "What is the revenue for Q1 2024?"
            workspaceId: "{{ $randomString() }}"
          expect:
            - statusCode: 200
            - contentType: json
            - responseTime:
                max: 5000

  # Document listing scenario
  - name: "List Documents"
    weight: 20
    flow:
      - get:
          url: "/api/documents?workspaceId=test-workspace"
          expect:
            - statusCode: 200
            - contentType: json
            - responseTime:
                max: 1000

  # Full conversation flow
  - name: "Conversation Flow"
    weight: 10
    flow:
      - post:
          url: "/api/chat"
          json:
            message: "Hello, I have questions about financial reports"
            workspaceId: "conv-test-{{ $randomString() }}"
          capture:
            - json: "$.chatId"
              as: "chatId"
          expect:
            - statusCode: 200
            
      - think: 2
      
      - post:
          url: "/api/chat"
          json:
            message: "What was the total revenue in 2024?"
            workspaceId: "conv-test-{{ $randomString() }}"
            chatId: "{{ chatId }}"
          expect:
            - statusCode: 200
            
      - think: 2
      
      - post:
          url: "/api/chat"
          json:
            message: "How does that compare to Q1?"
            workspaceId: "conv-test-{{ $randomString() }}"
            chatId: "{{ chatId }}"
          expect:
            - statusCode: 200

# Custom metrics tracking
metrics:
  - name: "chat_response_time"
    type: "histogram"
    match:
      url: "/api/chat"
      method: "POST"
      
  - name: "documents_response_time"
    type: "histogram"
    match:
      url: "/api/documents"
      method: "GET"

# Thresholds for pass/fail
thresholds:
  - metric: "http.response_time"
    threshold:
      p95: 2000
      p99: 5000
      
  - metric: "http.errors"
    threshold:
      rate: 0.05
      
  - metric: "vusers.failed"
    threshold:
      max: 10

# Reporting configuration
reporting:
  - plugin: "json"
    output: "performance-report.json"
  - plugin: "html"
    output: "performance-report.html"